[
  {
    "type": "group",
    "label": {
      "en": "Room Type Templates",
      "nl": "Kamertype Sjablonen",
      "de": "Raumtyp-Vorlagen",
      "no": "Romtype Maler",
      "sv": "Rumstyp Mallar"
    },
    "children": [
      {
        "id": "room_template_selector",
        "type": "dropdown",
        "label": {
          "en": "Apply Room Template",
          "nl": "Pas Kamersjabloon Toe",
          "de": "Raumvorlage Anwenden",
          "no": "Bruk Rommal",
          "sv": "Använd Rumsmall"
        },
        "value": "",
        "hint": {
          "en": "Select a room type to quickly pre-fill timer values with recommended settings. The dropdown will reset after applying. You can adjust values manually afterward.",
          "nl": "Selecteer een kamertype om timerwaard en snel in te vullen met aanbevolen instellingen. De dropdown wordt gereset na toepassing. U kunt waarden daarna handmatig aanpassen.",
          "de": "Wählen Sie einen Raumtyp aus, um Timer-Werte schnell mit empfohlenen Einstellungen vorzubefüllen. Das Dropdown wird nach der Anwendung zurückgesetzt. Sie können die Werte danach manuell anpassen.",
          "no": "Velg en romtype for å raskt forhåndsutfylle timerverdier med anbefalte innstillinger. Rullegardinmenyen tilbakestilles etter bruk. Du kan justere verdier manuelt etterpå.",
          "sv": "Välj en rumstyp för att snabbt förifylla timervärden med rekommenderade inställningar. Rullgardinsmenyn återställs efter användning. Du kan justera värden manuellt efteråt."
        },
        "values": [
          {
            "id": "",
            "label": {
              "en": "-- Select a room type --",
              "nl": "-- Selecteer een kamertype --",
              "de": "-- Wählen Sie einen Raumtyp --",
              "no": "-- Velg en romtype --",
              "sv": "-- Välj en rumstyp --"
            }
          },
          {
            "id": "bedroom",
            "label": {
              "en": "Bedroom",
              "nl": "Slaapkamer",
              "de": "Schlafzimmer",
              "no": "Soverom",
              "sv": "Sovrum"
            }
          },
          {
            "id": "bathroom",
            "label": {
              "en": "Bathroom",
              "nl": "Badkamer",
              "de": "Badezimmer",
              "no": "Baderom",
              "sv": "Badrum"
            }
          },
          {
            "id": "home_office",
            "label": {
              "en": "Home Office",
              "nl": "Thuiskantoor",
              "de": "Heimbüro",
              "no": "Hjemmekontor",
              "sv": "Hemmakontor"
            }
          },
          {
            "id": "kitchen",
            "label": {
              "en": "Kitchen",
              "nl": "Keuken",
              "de": "Küche",
              "no": "Kjøkken",
              "sv": "Kök"
            }
          },
          {
            "id": "living_room",
            "label": {
              "en": "Living Room",
              "nl": "Woonkamer",
              "de": "Wohnzimmer",
              "no": "Stue",
              "sv": "Vardagsrum"
            }
          },
          {
            "id": "hallway",
            "label": {
              "en": "Hallway / Corridor",
              "nl": "Gang / Corridor",
              "de": "Flur / Korridor",
              "no": "Gang / Korridor",
              "sv": "Hall / Korridor"
            }
          },
          {
            "id": "storage",
            "label": {
              "en": "Storage / Garage",
              "nl": "Opslag / Garage",
              "de": "Lagerraum / Garage",
              "no": "Lager / Garasje",
              "sv": "Förråd / Garage"
            }
          }
        ]
      }
    ]
  },
  {
    "id": "triggerSensors",
    "type": "textarea",
    "label": {
      "en": "Trigger Sensors",
      "nl": "Trigger Sensoren",
      "de": "Auslösesensoren",
      "no": "Triggsensorer",
      "sv": "Triggsensorer"
    },
    "hint": {
      "en": "Motion sensors that activate occupancy (JSON array, configured during pairing)",
      "nl": "Bewegingssensoren die aanwezigheid activeren (JSON array, geconfigureerd tijdens koppeling)",
      "de": "Bewegungsmelder, die Belegung aktivieren (JSON-Array, konfiguriert während der Kopplung)",
      "no": "Bevegelsessensorer som aktiverer tilstedeværelse (JSON-array, konfigurert under paring)",
      "sv": "Rörelsesensorer som aktiverar närvaro (JSON-array, konfigurerad vid parkoppling)"
    }
  },
  {
    "id": "resetSensors",
    "type": "textarea",
    "label": {
      "en": "Reset Sensors",
      "nl": "Reset Sensoren",
      "de": "Rücksetzsensoren",
      "no": "Nullstillingssensorer",
      "sv": "Återställningssensorer"
    },
    "hint": {
      "en": "Contact sensors that deactivate occupancy (JSON array, configured during pairing)",
      "nl": "Contactsensoren die aanwezigheid deactiveren (JSON array, geconfigureerd tijdens koppeling)",
      "de": "Kontaktsensoren, die Belegung deaktivieren (JSON-Array, konfiguriert während der Kopplung)",
      "no": "Kontaktsensorer som deaktiverer tilstedeværelse (JSON-array, konfigurert under paring)",
      "sv": "Kontaktsensorer som inaktiverar närvaro (JSON-array, konfigurerad vid parkoppling)"
    }
  },
  {
    "type": "group",
    "label": {
      "en": "Timer Settings",
      "nl": "Timer Instellingen",
      "de": "Timer-Einstellungen",
      "no": "Timer-innstillinger",
      "sv": "Timer-inställningar"
    },
    "children": [
      {
        "id": "t_enter",
        "type": "number",
        "label": {
          "en": "Door motion window",
          "nl": "Deur beweging venster",
          "de": "Türbewegungsfenster",
          "no": "Dørbevegelsesvindu",
          "sv": "Dörrörelsefönster"
        },
        "hint": {
          "en": "After a door opens or closes, the system waits this long to detect motion that indicates entry or exit. If motion is detected within this window, the room is marked as occupied (entry) or empty (exit). This helps distinguish between someone passing by versus actually entering or leaving. Typical: 10-30 seconds.",
          "nl": "Nadat een deur opent of sluit, wacht het systeem zo lang om beweging te detecteren die binnenkomst of vertrek aangeeft. Als beweging wordt gedetecteerd binnen dit venster, wordt de kamer gemarkeerd als bezet (binnenkomst) of leeg (vertrek). Dit helpt onderscheid maken tussen iemand die voorbijloopt versus daadwerkelijk binnenkomt of vertrekt. Typisch: 10-30 seconden.",
          "de": "Nachdem eine Tür geöffnet oder geschlossen wird, wartet das System so lange, um Bewegung zu erkennen, die Ein- oder Ausgang anzeigt. Wenn Bewegung innerhalb dieses Fensters erkannt wird, wird der Raum als belegt (Eintritt) oder leer (Austritt) markiert. Dies hilft, zwischen jemandem zu unterscheiden, der vorbeigeht, und jemandem, der tatsächlich eintritt oder verlässt. Typisch: 10-30 Sekunden.",
          "no": "Etter at en dør åpnes eller lukkes, venter systemet så lenge for å oppdage bevegelse som indikerer inngang eller utgang. Hvis bevegelse oppdages innenfor dette vinduet, markeres rommet som opptatt (inngang) eller tomt (utgang). Dette hjelper med å skille mellom noen som passerer forbi versus faktisk går inn eller ut. Typisk: 10-30 sekunder.",
          "sv": "Efter att en dörr öppnas eller stängs väntar systemet så länge för att upptäcka rörelse som indikerar inträde eller utgång. Om rörelse upptäcks inom detta fönster markeras rummet som upptaget (inträde) eller tomt (utgång). Detta hjälper till att skilja mellan någon som passerar förbi versus faktiskt går in eller ut. Typiskt: 10-30 sekunder."
        },
        "value": 20,
        "min": 5,
        "max": 60,
        "step": 1
      },
      {
        "id": "t_clear",
        "type": "number",
        "label": {
          "en": "Empty timeout",
          "nl": "Leeg timeout",
          "de": "Leer-Timeout",
          "no": "Tom timeout",
          "sv": "Tom timeout"
        },
        "hint": {
          "en": "When a door opens and no motion is detected during this period, the room is marked as empty. This prevents false negatives when someone exits but the door remains open. Only active when doors are open and no motion sensors are triggered. Typical: 300-900 seconds (5-15 minutes).",
          "nl": "Wanneer een deur opent en er geen beweging wordt gedetecteerd gedurende deze periode, wordt de kamer als leeg gemarkeerd. Dit voorkomt valse negatieven wanneer iemand vertrekt maar de deur open blijft. Alleen actief wanneer deuren open zijn en geen bewegingssensoren worden getriggerd. Typisch: 300-900 seconden (5-15 minuten).",
          "de": "Wenn eine Tür öffnet und während dieses Zeitraums keine Bewegung erkannt wird, wird der Raum als leer markiert. Dies verhindert falsche Negative, wenn jemand ausgeht, aber die Tür offen bleibt. Nur aktiv, wenn Türen offen sind und keine Bewegungsmelder ausgelöst werden. Typisch: 300-900 Sekunden (5-15 Minuten).",
          "no": "Når en dør åpnes og ingen bevegelse oppdages i løpet av denne perioden, markeres rommet som tomt. Dette forhindrer falske negativer når noen går ut, men døren forblir åpen. Kun aktiv når dører er åpne og ingen bevegelsessensorer utløses. Typisk: 300-900 sekunder (5-15 minutter).",
          "sv": "När en dörr öppnas och ingen rörelse upptäcks under denna period markeras rummet som tomt. Detta förhindrar falska negativ när någon går ut men dörren förblir öppen. Endast aktiv när dörrar är öppna och inga rörelsesensorer utlöses. Typiskt: 300-900 sekunder (5-15 minuter)."
        },
        "value": 600,
        "min": 60,
        "max": 3600,
        "step": 60
      },
      {
        "id": "stalePirMinutes",
        "type": "number",
        "label": {
          "en": "PIR stale timeout (minutes)",
          "nl": "PIR verlopen timeout (minuten)",
          "de": "PIR-Veraltungstimeout (Minuten)",
          "no": "PIR foreldet timeout (minutter)",
          "sv": "PIR föråldrad timeout (minuter)"
        },
        "hint": {
          "en": "Ignore PIR sensors stuck reporting motion for longer than this when initializing. Prevents false occupancy from stuck sensors. Typical: 30 minutes.",
          "nl": "Negeer PIR-sensoren die langer dan dit beweging blijven melden bij initialisatie. Voorkomt valse aanwezigheid van vastgelopen sensoren. Typisch: 30 minuten.",
          "de": "Ignorieren Sie PIR-Sensoren, die länger als dies Bewegung melden, bei der Initialisierung. Verhindert falsche Belegung durch festgefahrene Sensoren. Typisch: 30 Minuten.",
          "no": "Ignorer PIR-sensorer som rapporterer bevegelse lenger enn dette ved initialisering. Forhindrer falsk tilstedeværelse fra fastlåste sensorer. Typisk: 30 minutter.",
          "sv": "Ignorera PIR-sensorer som rapporterar rörelse längre än detta vid initialisering. Förhindrar falsk närvaro från fastnade sensorer. Typiskt: 30 minuter."
        },
        "value": 30,
        "min": 5,
        "max": 120,
        "step": 1
      },
      {
        "id": "staleDoorMinutes",
        "type": "number",
        "label": {
          "en": "Door stale timeout (minutes)",
          "nl": "Deur verlopen timeout (minuten)",
          "de": "Tür-Veraltungstimeout (Minuten)",
          "no": "Dør foreldet timeout (minutter)",
          "sv": "Dörr föråldrad timeout (minuter)"
        },
        "hint": {
          "en": "Ignore door sensors stuck reporting open for longer than this when initializing. Prevents false occupancy from stuck sensors. Typical: 30 minutes.",
          "nl": "Negeer deursensoren die langer dan dit open blijven melden bij initialisatie. Voorkomt valse aanwezigheid van vastgelopen sensoren. Typisch: 30 minuten.",
          "de": "Ignorieren Sie Türsensoren, die länger als dies offen melden, bei der Initialisierung. Verhindert falsche Belegung durch festgefahrene Sensoren. Typisch: 30 Minuten.",
          "no": "Ignorer dørsensorer som rapporterer åpne lenger enn dette ved initialisering. Forhindrer falsk tilstedeværelse fra fastlåste sensorer. Typisk: 30 minutter.",
          "sv": "Ignorera dörrsensorer som rapporterar öppen längre än detta vid initialisering. Förhindrar falsk närvaro från fastnade sensorer. Typiskt: 30 minuter."
        },
        "value": 30,
        "min": 5,
        "max": 120,
        "step": 1
      }
    ]
  }
]
