[
  {
    "id": "triggerSensors",
    "type": "textarea",
    "label": {
      "en": "Trigger Sensors",
      "nl": "Trigger Sensoren"
    },
    "hint": {
      "en": "Motion sensors that activate occupancy (JSON array, configured during pairing)",
      "nl": "Bewegingssensoren die aanwezigheid activeren (JSON array, geconfigureerd tijdens koppeling)"
    }
  },
  {
    "id": "resetSensors",
    "type": "textarea",
    "label": {
      "en": "Reset Sensors",
      "nl": "Reset Sensoren"
    },
    "hint": {
      "en": "Contact sensors that deactivate occupancy (JSON array, configured during pairing)",
      "nl": "Contactsensoren die aanwezigheid deactiveren (JSON array, geconfigureerd tijdens koppeling)"
    }
  },
  {
    "type": "group",
    "label": {
      "en": "Timer Settings",
      "nl": "Timer Instellingen"
    },
    "children": [
      {
        "id": "t_enter",
        "type": "number",
        "label": {
          "en": "Door motion window",
          "nl": "Deur beweging venster"
        },
        "hint": {
          "en": "After a door opens or closes, the system waits this long to detect motion that indicates entry or exit. If motion is detected within this window, the room is marked as occupied (entry) or empty (exit). This helps distinguish between someone passing by versus actually entering or leaving. Typical: 10-30 seconds.",
          "nl": "Nadat een deur opent of sluit, wacht het systeem zo lang om beweging te detecteren die binnenkomst of vertrek aangeeft. Als beweging wordt gedetecteerd binnen dit venster, wordt de kamer gemarkeerd als bezet (binnenkomst) of leeg (vertrek). Dit helpt onderscheid maken tussen iemand die voorbijloopt versus daadwerkelijk binnenkomt of vertrekt. Typisch: 10-30 seconden."
        },
        "value": 20,
        "min": 5,
        "max": 60,
        "step": 1
      },
      {
        "id": "t_clear",
        "type": "number",
        "label": {
          "en": "Empty timeout",
          "nl": "Leeg timeout"
        },
        "hint": {
          "en": "When a door opens and no motion is detected during this period, the room is marked as empty. This prevents false negatives when someone exits but the door remains open. Only active when doors are open and no motion sensors are triggered. Typical: 300-900 seconds (5-15 minutes).",
          "nl": "Wanneer een deur opent en er geen beweging wordt gedetecteerd gedurende deze periode, wordt de kamer als leeg gemarkeerd. Dit voorkomt valse negatieven wanneer iemand vertrekt maar de deur open blijft. Alleen actief wanneer deuren open zijn en geen bewegingssensoren worden getriggerd. Typisch: 300-900 seconden (5-15 minuten)."
        },
        "value": 600,
        "min": 60,
        "max": 3600,
        "step": 60
      }
    ]
  }
]
