{
  "1.0.0": {
    "en": "Initial release of Wasp in a Box - Virtual presence detection system"
  },
  "1.0.1": {
    "en": "Removed Homey Cloud platform support (Homey Pro only)"
  },
  "1.0.2": {
    "en": "Added GitHub support URLs for issue tracking and public support"
  },
  "1.0.3": {
    "en": "Documentation updates"
  },
  "1.0.4": {
    "en": "Added translations"
  },
  "1.0.5": {
    "en": "Release process updates"
  },
  "1.0.6": {
    "en": "Release process updates"
  },
  "1.0.7": {
    "en": "Release process updates"
  },
  "1.0.8": {
    "en": "Release process updates"
  },
  "1.0.16": {
    "en": "automatic app release"
  },
  "1.1.0": {
    "en": "New Device: Room State Manager for zone-based state tracking with state hierarchies and timer-based transitions. Occupancy Device Improvements: Event-driven sensor monitoring (replacing polling), room type templates for quick setup, stale sensor detection, and UI improvements."
  },
  "1.2.0": {
    "en": "Added Zone Seal Monitor driver that aggregates door/window sensors to detect when zones are sealed or leaky, enabling automated heating control based on room seal status. Room State Manager improved with pulsing occupancy indicator."
  },
  "1.2.1": {
    "en": "Improved device reliability with automatic error recovery and self-healing capabilities. Devices now provide clearer warning messages when issues occur and continue functioning even with partial failures."
  },
  "1.2.2": {
    "en": "Room State Manager pairing flow simplified: now select an existing WIAB occupancy device instead of configuring individual sensors. Room State Manager monitors WIAB device occupancy changes with configurable timer-based state transitions."
  },
  "1.2.3": {
    "en": "Added Circuit Breaker device for hierarchical flow control. Code cleanup and refactoring."
  },
  "1.2.4": {
    "en": "Added state-specific triggers for Room State Manager (extended_occupied, occupied, unoccupied, extended_unoccupied). Added explanatory intro pages to all device pairing flows. Added translations for pairing screens. Fixed timeout issue when updating circuit breaker hierarchy. Improved error handling to prevent silent failures."
  },
  "1.2.5": {
    "en": "minor improvements in documentation and ui to improve user experience."
  },
  "1.2.6": {
    "en": "minor fixes"
  },
  "1.2.7": {
    "en": "Fixed critical Zone Seal fail-safe bug where stale sensors could incorrectly mark zones as sealed. Improved error handling to prevent crashes. Internal code quality improvements."
  },
  "1.2.8": {
    "en": "minor zone seal edge case fix."
  },
  "1.2.9": {
    "en": "zone seal diagnostig logging added"
  },
  "1.2.10": {
    "en": "dependency updates"
  },
  "1.2.11": {
    "en": "optimized device initialization"
  },
  "1.2.12": {
    "en": "zone seal fail safe added for stale sensors"
  },
  "1.2.13": {
    "en": "improved wiab stale sensor handling"
  },
  "1.2.14": {
    "en": "Fixed WIAB occupancy fail-safe: when all sensors become stale, device now correctly sets occupancy to UNOCCUPIED instead of preserving the previous OCCUPIED state. This prevents                +lights/HVAC running indefinitely when sensors stop reporting."
  },
  "1.2.15": {
    "en": "zone seal fail safe improvements"
  },
  "1.2.16": {
    "en": "certification requirement fix"
  },
  "1.2.17": {
    "en": "support for devices with only alarm_occupancy"
  },
  "1.3.0": {
    "en": "BREAKING CHANGE: Room State Manager device has been removed. Room state functionality is now built into the WIAB Occupancy device. Existing Room State Manager devices must be deleted and recreated as WIAB devices with room state enabled. New features: integrated room state tracking with timer-based transitions (idle → extended_idle, occupied → extended_occupied), manual override mode, and improved state flow cards."
  }
}
