{
  "pair": {
    "wiab_device": {
      "intro": {
        "title": "WIAB Apparaat",
        "description": "WIAB (Wesp In Een Doos) creëert een virtuele aanwezigheidssensor door fysieke sensoren in uw kamer te monitoren. Net als een wesp die in een doos gevangen zit en actief blijft totdat hij de uitgang vindt, blijft het apparaat bezet totdat aan specifieke voorwaarden is voldaan.",
        "key_feature": "Belangrijkste functie:",
        "key_feature_description": "Combineert meerdere sensoren om intelligente kamer aanwezigheidsdetectie te creëren met configureerbare activerings- en deactiveringstriggers.",
        "trigger_sensors": "Triggersensoren:",
        "trigger_sensors_description": "Bewegingssensoren of andere apparaten die aanwezigheid activeren (wesp komt de doos in)",
        "reset_sensors": "Resetsensoren:",
        "reset_sensors_description": "Deurcontacten of andere sensoren die aanwezigheid deactiveren (wesp vindt de uitgang)",
        "edge_detection": "Randdetectie:",
        "edge_detection_description": "Alleen ONWAAR→WAAR overgangen activeren acties, waardoor herhaalde activeringen worden voorkomen",
        "priority": "Prioriteitslogica:",
        "priority_description": "Resetsensoren worden eerst gecontroleerd, zodat uitgangen altijd voorrang hebben",
        "polling": "Betrouwbare polling:",
        "polling_description": "Controleert sensoren elke 2 seconden voor consistent gedrag",
        "next_step": "In de volgende stappen selecteert u een kamertype, configureert u triggersensoren (om aanwezigheid te detecteren) en resetsensoren (om uitgangen te detecteren)."
      },
      "select_room_type": {
        "title": "Selecteer Ruimtetype (Optioneel)",
        "intro": "Kies een ruimtetype om timerwaarden automatisch in te stellen met aanbevolen instellingen voor die ruimte. U kunt deze waarden later nog aanpassen in de apparaatinstellingen, of sla deze stap over om handmatig in te stellen.",
        "error_prefix": "Fout:",
        "error_failed_to_load": "Ruimtsjablonen konden niet worden geladen:",
        "door_motion_window": "Deur-bewegingsvenster:",
        "empty_timeout": "Leeg timeout:",
        "pir_stale_timeout": "PIR stale timeout:",
        "door_stale_timeout": "Deur stale timeout:",
        "error_failed_apply": "Sjabloon kon niet worden toegepast:",
        "error_try_different": "Er is een fout opgetreden. Probeer een ander sjabloon.",
        "error_template_not_found": "Sjabloon niet gevonden. Selecteer een ander sjabloon.",
        "error_pairing_failed": "Koppelingskader kon niet worden geladen. Start de Homey-app opnieuw en probeer het opnieuw.",
        "error_code_init_failed": "Neem contact op met ondersteuning met foutcode: HOMEY_INIT_FAILED",
        "error_sdk_not_available": "Homey SDK niet beschikbaar. Start de koppeling opnieuw.",
        "error_code_api_missing": "Neem contact op met ondersteuning met foutcode: HOMEY_API_MISSING"
      },
      "select_trigger_sensors": {
        "title": "Selecteer Bewegingssensoren",
        "intro": "Selecteer de bewegingssensoren die aanwezigheidsdetectie activeren.",
        "search_placeholder": "Zoek sensoren...",
        "no_devices": "Geen bewegingssensoren gevonden. Voeg eerst bewegingssensoren toe aan uw Homey.",
        "error_failed_to_load": "Bewegingssensoren konden niet worden geladen:",
        "no_zone": "Geen zone"
      },
      "select_reset_sensors": {
        "title": "Selecteer Reset-sensoren",
        "intro": "Selecteer contactsensoren die de aanwezigheid opnieuw instellen wanneer ze worden geopend (bijv. deuren, ramen).",
        "skip_note": "Deze stap is optioneel. U kunt op Volgende klikken om over te slaan als u geen reset-sensoren wilt gebruiken.",
        "search_placeholder": "Zoek sensoren...",
        "no_devices": "Geen contactsensoren gevonden. Klik op Volgende om verder te gaan zonder reset-sensoren.",
        "error_failed_to_load": "Contactsensoren konden niet worden geladen:",
        "no_zone": "Geen zone"
      }
    },
    "room_state": {
      "intro": {
        "title": "Kamerstatus Manager",
        "description": "De Kamerstatus Manager voegt intelligente statustracking toe aan uw WIAB-apparaat. Het monitort aanwezigheid en schakelt automatisch tussen statussen op basis van configureerbare timers, waardoor meer context voor uw automatiseringen wordt geboden.",
        "key_feature": "Belangrijkste functie:",
        "key_feature_description": "Vier-status systeem dat niet alleen bijhoudt of een kamer bezet is, maar ook hoe lang - waardoor tijdsbewuste automatiseringen mogelijk zijn.",
        "idle": "Vrij:",
        "idle_description": "Kamer is onbezet (geen activiteit gedetecteerd)",
        "extended_idle": "Verlengd Vrij:",
        "extended_idle_description": "Kamer is al langere tijd onbezet (configureerbare timeout)",
        "occupied": "Bezet:",
        "occupied_description": "Kamer is momenteel bezet (activiteit gedetecteerd)",
        "extended_occupied": "Verlengd Bezet:",
        "extended_occupied_description": "Kamer is al langere tijd bezet (configureerbare timeout)",
        "manual_override": "Handmatige overschrijving:",
        "manual_override_description": "Stel statussen handmatig in via flows en keer terug naar automatische modus wanneer nodig",
        "next_step": "In de volgende stappen selecteert u een WIAB-apparaat om te monitoren en configureert u de timeout-duur voor verlengde statussen."
      },
      "select_wiab": {
        "title": "Selecteer WIAB-apparaat",
        "intro": "Selecteer het WIAB-apparaat (Wasp in a Box) dat aanwezigheid voor deze Ruimtestatus Manager zal leveren.",
        "error_no_devices": "Geen WIAB-apparaten gevonden. Maak eerst een WIAB-apparaat aan.",
        "label_wiab_device": "WIAB-apparaat",
        "loading_devices": "Apparaten laden...",
        "hint_device_selection": "De aanwezigheidsstatus van het geselecteerde WIAB-apparaat wordt gebruikt als invoer voor ruimtestatusovergangen.",
        "error_pairing_failed": "Koppelingskader kon niet worden geladen. Start de Homey-app opnieuw en probeer het opnieuw.",
        "error_sdk_not_available": "Homey SDK niet beschikbaar. Start de koppeling opnieuw."
      },
      "define_states": {
        "title": "Ruimtestatussen Configureren",
        "intro": "De Ruimtestatus Manager volgt uitgebreide aanwezigheidsstatussen op basis van het WIAB-apparaat dat u hebt geselecteerd.",
        "states_info_title": "Ruimtestatussen",
        "state_idle": "inactief - Ruimte is inactief (geen activiteit gedetecteerd)",
        "state_extended_idle": "uitgebreid inactief - Ruimte is een tijdje inactief geweest (optioneel)",
        "state_occupied": "bezet - Ruimte is actief (activiteit gedetecteerd)",
        "state_extended_occupied": "uitgebreid bezet - Ruimte is een tijdje actief geweest (optioneel)",
        "label_idle_timeout": "Uitgebreide inactiviteit-timeout (minuten)",
        "hint_idle_timeout": "Minuten inactiviteit voordat wordt overgeschakeld naar de status 'uitgebreid inactief'. Stel in op 0 om uit te schakelen.",
        "label_occupied_timeout": "Uitgebreide activiteit-timeout (minuten)",
        "hint_occupied_timeout": "Minuten activiteit voordat wordt overgeschakeld naar de status 'uitgebreid bezet'. Stel in op 0 om uit te schakelen."
      }
    },
    "zone_seal": {
      "intro": {
        "title": "Zone Afdichting",
        "description": "Zone Afdichting monitort deur- en raamcontactsensoren in een zone om te bepalen of de zone goed is afgesloten (alle deuren en ramen gesloten) of lek is (ten minste één opening gedetecteerd).",
        "key_feature": "Belangrijkste functie:",
        "key_feature_description": "Aggregeert meerdere contactsensoren om een enkele afgesloten/lek status te bieden, perfect voor beveiligingscontroles, klimaatregeling of automatiseringstriggers.",
        "sealed": "Afgesloten:",
        "sealed_description": "Alle gemonitorde deuren en ramen zijn gesloten",
        "leaky": "Lek:",
        "leaky_description": "Ten minste één deur of raam is open",
        "stale_detection": "Verouderde detectie:",
        "stale_detection_description": "Identificeert sensoren die een tijdje niet hebben gerapporteerd, wat wijst op mogelijke batterij- of connectiviteitsproblemen",
        "zone_based": "Zone-gebaseerd:",
        "zone_based_description": "Ontdekt automatisch alle contactsensoren in de geselecteerde Homey-zone",
        "flow_triggers": "Flow-triggers:",
        "flow_triggers_description": "Activeer flows wanneer de zone afgesloten, lek wordt of wanneer verouderde sensoren worden gedetecteerd",
        "next_step": "In de volgende stap selecteert u een Homey-zone om te monitoren. Alle contactsensoren in die zone worden automatisch opgenomen."
      },
      "select_contact_sensors": {
        "title": "Selecteer Contactsensoren",
        "intro": "Selecteer de contact- en raamsensoren die de zonesluiting bepalen. Wanneer een sensor open is, wordt de zone als lek beschouwd.",
        "search_placeholder": "Zoek sensoren...",
        "no_devices": "Geen contactsensoren gevonden. Voeg eerst deur- of raamsensoren toe aan uw Homey.",
        "error_failed_to_load": "Contactsensoren konden niet worden geladen:",
        "no_zone": "Geen zone"
      }
    },
    "circuit_breaker": {
      "intro": {
        "title": "Circuitonderbreker",
        "intro": "Circuitonderbrekers leveren hiërarchische stroomregeling voor uw Homey-automatiseringen. Net als elektrische circuitonderbrekers kunnen ze worden ingeschakeld (stromen toestaan) of uitgeschakeld (stromen blokkeren).",
        "key_feature": "Belangrijkste kenmerk:",
        "key_feature_text": "Circuitonderbrekers kunnen in een hoofd-kind-hiërarchie worden georganiseerd. Wanneer een bovenliggende onderbreker wordt uitgeschakeld, worden alle onderliggende onderbrekers automatisch ook uitgeschakeld.",
        "hierarchical_control": "Hiërarchische besturing:",
        "hierarchical_control_text": "Organiseer onderbrekers in een boomstructuur (bijv. 'Huis' → 'Verdieping 1' → 'Woonkamer')",
        "cascade_behavior": "Kaskaadgedrag:",
        "cascade_behavior_text": "Een bovenliggende uitschakelen schakelt automatisch alle onderliggende uit",
        "independent_children": "Onafhankelijke kinderen:",
        "independent_children_text": "Kinderen kunnen onafhankelijk van de bovenliggende status worden bestuurd",
        "no_cycles": "Geen cykli:",
        "no_cycles_text": "Het systeem voorkomt automatisch circulaire afhankelijkheden",
        "root_breakers": "Wortels onderbrekers:",
        "root_breakers_text": "Onderbrekers zonder bovenliggend element functioneren als topniveau besturingen",
        "next_step": "In de volgende stap kunt u optioneel een bovenliggende circuitonderbreker voor dit apparaat selecteren. U kunt dit later altijd wijzigen in de apparaatinstellingen."
      },
      "select_parent": {
        "title": "Selecteer Bovenliggende Onderbreker",
        "intro": "Kies een bovenliggende circuitonderbreker voor hiërarchische besturing, of selecteer 'Geen' om een onderbreker op het hoogste niveau te maken.",
        "error_failed_to_load": "Circuitonderbrekers konden niet worden geladen. Probeer het opnieuw.",
        "label_parent_breaker": "Bovenliggende Circuitonderbreker",
        "loading_breakers": "Circuitonderbrekers laden...",
        "hint_parent_selection": "Wanneer de bovenliggende onderbreker wordt uitgeschakeld, wordt deze onderbreker ook automatisch uitgeschakeld.",
        "option_none": "Geen (Wortels onderbreker)",
        "error_pairing_failed": "Koppelingskader kon niet worden geladen. Start de Homey-app opnieuw en probeer het opnieuw.",
        "error_sdk_not_available": "Homey SDK niet beschikbaar. Start de koppeling opnieuw."
      }
    }
  }
}
