{
  "pair": {
    "wiab_device": {
      "intro": {
        "title": "WIAB Enhet",
        "description": "WIAB (Geting I En Låda) skapar en virtuell närvarosensor genom att övervaka fysiska sensorer i ditt rum. Som en geting fångad i en låda som förblir aktiv tills den hittar utgången, förblir enheten upptagen tills specifika villkor uppfylls.",
        "key_feature": "Huvudfunktion:",
        "key_feature_description": "Kombinerar flera sensorer för att skapa intelligent rumsnärvarodetektering med konfigurerbara aktiverings- och avaktiveringsutlösare.",
        "trigger_sensors": "Utlösarsensorer:",
        "trigger_sensors_description": "Rörelsesensorer eller andra enheter som aktiverar närvaro (geting kommer in i lådan)",
        "reset_sensors": "Återställningssensorer:",
        "reset_sensors_description": "Dörrkontakter eller andra sensorer som avaktiverar närvaro (geting hittar utgången)",
        "edge_detection": "Flankdetektering:",
        "edge_detection_description": "Endast FALSKT→SANT övergångar utlöser åtgärder, förhindrar upprepade aktiveringar",
        "priority": "Prioritetslogik:",
        "priority_description": "Återställningssensorer kontrolleras först, säkerställer att utgångar alltid har prioritet",
        "polling": "Tillförlitlig polling:",
        "polling_description": "Kontrollerar sensorer var 2:a sekund för konsekvent beteende",
        "next_step": "I nästa steg väljer du en rumstyp, konfigurerar utlösarsensorer (för att upptäcka närvaro) och återställningssensorer (för att upptäcka utgångar)."
      },
      "select_room_type": {
        "title": "Välj rumstyp (valfritt)",
        "intro": "Välj en rumstyp för att automatiskt konfigurera timervärdena med rekommenderade inställningar för det rummet. Du kan fortfarande justera dessa värden senare i enhetsinställningar, eller hoppa över detta steg för manuell konfiguration.",
        "error_prefix": "Fel:",
        "error_failed_to_load": "Det gick inte att ladda rumsmallar:",
        "door_motion_window": "Dörrmotionsfönster:",
        "empty_timeout": "Timeout för tomt rum:",
        "pir_stale_timeout": "Timeout för inaktuell PIR:",
        "door_stale_timeout": "Timeout för inaktuell dörrkontakt:",
        "error_failed_apply": "Det gick inte att tillämpa mallen:",
        "error_try_different": "Ett fel uppstod. Försök med en annan mall.",
        "error_template_not_found": "Mall hittades inte. Välj en annan mall.",
        "error_pairing_failed": "Det gick inte att ladda kopplingsramverket. Starta om Homey-appen och försök igen.",
        "error_code_init_failed": "Om detta kvarstår, kontakta support med felkod: HOMEY_INIT_FAILED",
        "error_sdk_not_available": "Homey SDK är inte tillgänglig. Starta om kopplingen.",
        "error_code_api_missing": "Om detta kvarstår, kontakta support med felkod: HOMEY_API_MISSING"
      },
      "select_trigger_sensors": {
        "title": "Välj rörelsesensorer",
        "intro": "Välj de rörelsesensorer som ska utlösa upptäckningen av närvaro.",
        "search_placeholder": "Sök sensorer...",
        "no_devices": "Inga rörelsesensorer hittades. Lägg först till rörelsesensorer i din Homey.",
        "error_failed_to_load": "Det gick inte att ladda rörelsesensorer:",
        "no_zone": "Ingen zon"
      },
      "select_reset_sensors": {
        "title": "Välj återställningssensorer",
        "intro": "Välj dörrkontakter som ska återställa närvaron när de öppnas (t.ex. dörrar, fönster).",
        "skip_note": "Detta steg är valfritt. Du kan klicka på Nästa för att hoppa över om du inte vill använda återställningssensorer.",
        "search_placeholder": "Sök sensorer...",
        "no_devices": "Inga dörrkontakter hittades. Klicka på Nästa för att fortsätta utan återställningssensorer.",
        "error_failed_to_load": "Det gick inte att ladda dörrkontakter:",
        "no_zone": "Ingen zon"
      }
    },
    "room_state": {
      "intro": {
        "title": "Rumstillstånd Manager",
        "description": "Rumstillstånd Manager lägger till intelligent tillståndsspårning till din WIAB-enhet. Den övervakar beläggning och byter automatiskt mellan tillstånd baserat på konfigurerbara timers, vilket ger mer kontext för dina automatiseringar.",
        "key_feature": "Huvudfunktion:",
        "key_feature_description": "Fyra-tillstånds system som spårar inte bara om ett rum är upptaget, utan hur länge - möjliggör tidsmedvetna automatiseringar.",
        "idle": "Ledigt:",
        "idle_description": "Rummet är ledigt (ingen aktivitet upptäckt)",
        "extended_idle": "Utökat Ledigt:",
        "extended_idle_description": "Rummet har varit ledigt under en längre period (konfigurerbar timeout)",
        "occupied": "Upptaget:",
        "occupied_description": "Rummet är för närvarande upptaget (aktivitet upptäckt)",
        "extended_occupied": "Utökat Upptaget:",
        "extended_occupied_description": "Rummet har varit upptaget under en längre period (konfigurerbar timeout)",
        "manual_override": "Manuell åsidosättning:",
        "manual_override_description": "Ställ in tillstånd manuellt via flöden och återgå till automatiskt läge vid behov",
        "next_step": "I nästa steg väljer du en WIAB-enhet att övervaka och konfigurerar timeout-varaktigheterna för utökade tillstånd."
      },
      "select_wiab": {
        "title": "Välj WIAB-enhet",
        "intro": "Välj WIAB-enheten (Wasp in a Box) som ska tillhandahålla närvarodata för denna rumstillståndshanterare.",
        "error_no_devices": "Inga WIAB-enheter hittades. Skapa först en WIAB-enhet.",
        "label_wiab_device": "WIAB-enhet",
        "loading_devices": "Läser in enheter...",
        "hint_device_selection": "Den valda WIAB-enhetens närvårotillstånd används som indata för rumstillståndsövergångar.",
        "error_pairing_failed": "Det gick inte att ladda kopplingsramverket. Starta om Homey-appen och försök igen.",
        "error_sdk_not_available": "Homey SDK är inte tillgänglig. Starta om kopplingen."
      },
      "define_states": {
        "title": "Konfigurera rumstillstånd",
        "intro": "Rumstillståndshanteraren spårar utökade närvårotillstånd baserat på den WIAB-enhet du valde.",
        "states_info_title": "Rumstillstånd",
        "state_idle": "idle - Rummet är inaktivt (ingen aktivitet upptäckt)",
        "state_extended_idle": "extended_idle - Rummet har varit inaktivt ett tag (valfritt)",
        "state_occupied": "occupied - Rummet är aktivt (aktivitet upptäckt)",
        "state_extended_occupied": "extended_occupied - Rummet har varit aktivt ett tag (valfritt)",
        "label_idle_timeout": "Timeout för utökat inaktivt tillstånd (minuter)",
        "hint_idle_timeout": "Minuter av inaktivitet innan övergång till extended_idle-tillståndet. Ställ in på 0 för att inaktivera.",
        "label_occupied_timeout": "Timeout för utökat aktivt tillstånd (minuter)",
        "hint_occupied_timeout": "Minuter av aktivitet innan övergång till extended_occupied-tillståndet. Ställ in på 0 för att inaktivera."
      }
    },
    "zone_seal": {
      "intro": {
        "title": "Zontätning",
        "description": "Zontätning övervakar dörr- och fönsterkontaktsensorer i en zon för att avgöra om zonen är ordentligt tätad (alla dörrar och fönster stängda) eller läcker (minst en öppning upptäckt).",
        "key_feature": "Huvudfunktion:",
        "key_feature_description": "Aggregerar flera kontaktsensorer för att ge en enda tätad/läckande status, perfekt för säkerhetskontroller, klimatstyrning eller automatiseringsutlösare.",
        "sealed": "Tätad:",
        "sealed_description": "Alla övervakade dörrar och fönster är stängda",
        "leaky": "Läckande:",
        "leaky_description": "Minst en dörr eller fönster är öppet",
        "stale_detection": "Föråldrad detektering:",
        "stale_detection_description": "Identifierar sensorer som inte har rapporterat på ett tag, vilket indikerar möjliga batteri- eller anslutningsproblem",
        "zone_based": "Zonbaserad:",
        "zone_based_description": "Upptäcker automatiskt alla kontaktsensorer i den valda Homey-zonen",
        "flow_triggers": "Flödesutlösare:",
        "flow_triggers_description": "Utlös flöden när zonen blir tätad, läckande eller när föråldrade sensorer upptäcks",
        "next_step": "I nästa steg väljer du en Homey-zon att övervaka. Alla kontaktsensorer i den zonen kommer automatiskt att inkluderas."
      },
      "select_contact_sensors": {
        "title": "Välj dörrkontakter",
        "intro": "Välj dörr- och fönsterkontakterna som ska definiera zonens tätning. När NÅGON sensor är öppen anses zonen läcka.",
        "search_placeholder": "Sök sensorer...",
        "no_devices": "Inga dörrkontakter hittades. Lägg först till dörr- eller fönsterkontakter i din Homey.",
        "error_failed_to_load": "Det gick inte att ladda dörrkontakter:",
        "no_zone": "Ingen zon"
      }
    },
    "circuit_breaker": {
      "intro": {
        "title": "Strömbrytare",
        "intro": "Strömbrytare tillhandahåller hierarkisk flödeskontroll för dina Homey-automationer. Som elektriska strömbrytare kan de slås på (för att tillåta flöden) eller av (för att blockera flöden).",
        "key_feature": "Huvudfunktion:",
        "key_feature_text": "Strömbrytare kan organiseras i en hierarki för överordnade och underordnade enheter. När en överordnad strömbrytare slås av stängs alla dess underordnade strömbrytare automatiskt av.",
        "hierarchical_control": "Hierarkisk kontroll:",
        "hierarchical_control_text": "Organisera strömbrytare i en trädstruktur (t.ex. \"Hus\" → \"Våning 1\" → \"Vardagsrum\")",
        "cascade_behavior": "Kaskaderat beteende:",
        "cascade_behavior_text": "Att slå av en överordnad strömbrytare stänger automatiskt alla dess underordnade",
        "independent_children": "Oberoende underordnade:",
        "independent_children_text": "Underordnade kan fortfarande kontrolleras oberoende av överordnads tillstånd",
        "no_cycles": "Inga cykler:",
        "no_cycles_text": "Systemet förhindrar cirkulära beroenden automatiskt",
        "root_breakers": "Rotströmbrytare:",
        "root_breakers_text": "Strömbrytare utan överordnad fungerar som toppnivåkontroller",
        "next_step": "I nästa steg kan du välja en överordnad strömbrytare för denna enhet. Du kan alltid ändra detta senare i enhetsinställningar."
      },
      "select_parent": {
        "title": "Välj överordnad strömbrytare",
        "intro": "Välj en överordnad strömbrytare för hierarkisk kontroll, eller välj \"Ingen\" för att skapa en rotströmbrytare.",
        "error_failed_to_load": "Det gick inte att ladda strömbrytare. Försök igen.",
        "label_parent_breaker": "Överordnad strömbrytare",
        "loading_breakers": "Läser in strömbrytare...",
        "hint_parent_selection": "När den överordnade strömbrytaren stängs av kommer denna strömbrytare också att stängas av automatiskt.",
        "option_none": "Ingen (rotströmbrytare)",
        "error_pairing_failed": "Det gick inte att ladda kopplingsramverket. Starta om Homey-appen och försök igen.",
        "error_sdk_not_available": "Homey SDK är inte tillgänglig. Starta om kopplingen."
      }
    }
  }
}
